""" Файловая система
Далее рассмотрим работу с файловой системой средствами Python. В этой части
разберём некоторые модули стандартной библиотеки для решения задач работы с
файловой системой.
1. Модуль os позволяет использовать функции, зависящие от файловой
системы.
2. Для работы с путями используют модуль os.path.
3. Модуль pathlib позволяет работать с путями файловой системы в ООП стиле.
4. Модуль shutil обеспечивает высокоуровневые операции над файлами и
группами файлов.
Если задачу можно решить несколькими способами, рассмотрим варианты
одновременно."""

