"""Задание №1
Создайте, несколько переменных разных типов.
Проверьте к какому типу относятся созданные переменные."""

a = 5
b = 4.8
c = 'hello'
d = True

print(type(a))  # <class 'int'>
print(type(b))  # <class 'float'>
print(type(c))  # <class 'str'>
print(type(d))  # <class 'bool'>
