help(map)

"""
class map(object)
  | map(func, *iterables) -->  map object объект карты
  |
  | Создайте итератор, который вычисляет функцию, используя аргументы из
  | каждый из итераций. Останавливается, когда самая короткая итерация исчерпана.
  |
  | Определенные здесь методы:
  |
  | __getattribute__(self, имя, /)
  |     Return getattr(self, name).
  |
  | __iter__(self, /)
  |     Implement iter(self).
  |
  | __следующий__(self, /)
  |     Implement next(self).
  |
  | __reduce__(...)
  | Возвращает информацию о состоянии для травления.
  |
  | -------------------------------------------------- --------------------
  | Статические методы определены здесь:
  |
  | __new__(*args, **kwargs) from builtins.type
  | Создать и вернуть новый объект. См. help(type) для точной подписи."""